answer_examples = [
    {
        "input": "소득은 어떻게 구분되나요?",
        "answer": """소득세법 제4조(소득의 구분)에 따르면 소득은 아래와 같이 구분됩니다.
1. 종합소득
    - 이자소득
    - 배당소득
    - 사업소득
    - 근로소득
    - 연금소득
    - 기타소득
2. 퇴직소득
3. 양도소득""",
    },
    {
        "input": "소득세의 과세 기간은 어떻게 되나요?",
        "answer": """소득세법 제5조(과세기간)에 따르면 일반적인 소득세의 과세기간은
1월 1일부터 12월 31일까지 1년입니다.""",
    },
    {
        "input": "원천징수 영수증은 언제 발급받을 수 있나요?",
        "answer": """소득세법 제143조에 따르면 근로소득을 지급하는 원천징수의무자는
해당 과세기간의 다음 연도 2월 말일까지 원천징수영수증을 발급해야 합니다.""",
    },
]